In [1]:
import pandas as pd
import numpy as np

## TH1

In [2]:
data1 = {'Hoten': ['nva', 'nvb', 'ltc'],
         'Tuoi': [22, 25, 20]}
df1 = pd.DataFrame(data1)
df1

  Hoten  Tuoi
0   nva    22
1   nvb    25
2   ltc    20

In [9]:
data2 = {'Hoten': ['nva', 'ltc', 'nvb'],
         'Dienthoai': ['222333', np.nan, '111222']}
df2 = pd.DataFrame(data2)
df2

  Hoten Dienthoai
0   nva    222333
1   ltc       NaN
2   nvb    111222

In [10]:
df_new1 = pd.merge(left=df1, right=df2, on='Hoten')
df_new1

  Hoten  Tuoi Dienthoai
0   nva    22    222333
1   nvb    25    111222
2   ltc    20       NaN

In [11]:
df_new2 = pd.merge(left=df1, right=df2)
df_new2

  Hoten  Tuoi Dienthoai
0   nva    22    222333
1   nvb    25    111222
2   ltc    20       NaN

## TH2

In [12]:
data1 = {'Hoten': ['nva', 'nvb', 'ltc'],
         'Tuoi': [22, 25, 20]}
df1 = pd.DataFrame(data1)
df1

  Hoten  Tuoi
0   nva    22
1   nvb    25
2   ltc    20

In [13]:
data2 = {'ten': ['nva', 'ltc', 'nvb'],
         'Dienthoai': ['222333', np.nan, '111222']}
df2 = pd.DataFrame(data2)
df2

   ten Dienthoai
0  nva    222333
1  ltc       NaN
2  nvb    111222

In [15]:
df_new3 = pd.merge(left=df1, right=df2, left_on='Hoten', right_on='ten')
df_new3

  Hoten  Tuoi  ten Dienthoai
0   nva    22  nva    222333
1   nvb    25  nvb    111222
2   ltc    20  ltc       NaN

In [16]:
df_new3 = df_new3.drop('ten', axis=1)
df_new3

  Hoten  Tuoi Dienthoai
0   nva    22    222333
1   nvb    25    111222
2   ltc    20       NaN

## TH3

In [17]:
data1 = {'Hoten': ['nva', 'nvb', 'ltc'],
         'Tuoi': [22, 25, 20]}
df1 = pd.DataFrame(data1)
df1

  Hoten  Tuoi
0   nva    22
1   nvb    25
2   ltc    20

In [19]:
data2 = {'ten': ['nva', 'ltc', 'nvb'],
         'Dienthoai': ['222333', np.nan, '111222']}
df2 = pd.DataFrame(data2)
df2.set_index('ten', inplace=True)
df2

    Dienthoai
ten
nva    222333
ltc       NaN
nvb    111222

In [20]:
df_new4 = pd.merge(left=df1, right=df2, left_on='Hoten', right_index=True)
df_new4

  Hoten  Tuoi Dienthoai
0   nva    22    222333
1   nvb    25    111222
2   ltc    20       NaN

## TH4: sort

In [21]:
data1 = {'Hoten': ['nva', 'ltc', 'nvb'],
         'Tuoi': [22, 20, 25]}
df1 = pd.DataFrame(data1)
df1

  Hoten  Tuoi
0   nva    22
1   ltc    20
2   nvb    25

In [22]:
data2 = {'Hoten': ['nva', 'ltc', 'nvb'],
         'Dienthoai': ['222333', np.nan, '111222']}
df2 = pd.DataFrame(data2)
df2

  Hoten Dienthoai
0   nva    222333
1   ltc       NaN
2   nvb    111222

In [23]:
df_new5 = pd.merge(left=df1, right=df2, on='Hoten')
df_new5

  Hoten  Tuoi Dienthoai
0   nva    22    222333
1   ltc    20       NaN
2   nvb    25    111222

In [24]:
df_new5 = pd.merge(left=df1, right=df2, on='Hoten', sort=True)
df_new5

  Hoten  Tuoi Dienthoai
0   ltc    20       NaN
1   nva    22    222333
2   nvb    25    111222